{
    "Operating System" :  [
        {"ques":"What is Operating System?", "ans":"The operating system is a software program that facilitates computer hardware to communicate and operate with the software applications and it acts as an interface between the user and the computer hardware. It is the most important part of a computer system without it computer is just like a box"},
        {"ques":"What is Deadlock?", "ans":"Deadlock is a situation when two or more processes wait for each other to finish and none of them ever finish. Consider an example when two trains are coming toward each other on same track and there is only one track, none of the trains can move once they are in front of each other. Similar situation occurs in operating systems when there are two or more processes hold some resources and wait for resources held by other(s)."},
        {"ques":"What is Time-sharing system?", "ans":"In a Time-sharing system, the CPU executes multiple jobs by switching among them, also known as multitasking. This process happens so fast that users can interact with each program while it is running."},
        {"ques":"Define Thoroughput.", "ans":"Throughput – number of processes that complete their execution per time unit. Turnaround time – amount of time to execute a particular process. Waiting time – amount of time a process has been waiting in the ready queue. Response time – amount of time it takes from when a request was submitted until the first response is produced, not output (for time-sharing environment)."},
        {"ques":"What are the functions of operating system?","ans":"The operating system controls and coordinates the use of hardware among the different processes and applications. It provides the various functionalities to the users. The following are the main job of operating system."},
        {"ques":"What Are Real-time Systems?", "ans":"Real-time systems are used when rigid time requirements have been placed on the operation of a processor. It has well defined and fixed time constraints."}, 
        {"ques":"Explain the concept of Reentrancy?", "ans":"It is a useful, memory-saving technique for multiprogrammed timesharing systems. A Reentrant Procedure is one in which multiple users can share a single copy of a program during the same period. Reentrancy has 2 key aspects: The program code cannot modify itself, and the local data for each user process must be stored separately. Thus, the permanent part is the code, and the temporary part is the pointer back to the calling program and local variables used by that program. Each execution instance is called activation. It executes the code in the permanent part, but has its own copy of local variables/parameters. The temporary part associated with each activation is the activation record. Generally, the activation record is kept on the stack.Note: A reentrant procedure can be interrupted and called by an interrupting program, and still execute correctly on returning to the procedure."},
        {"ques":"What is multi-programming, and what are the advantages?", "ans":"A multiprogramming operating system is one that allows a process where multiple programs execute over one CPU. If your interviewer asks OS questions on multiprogramming, you can highlight key differences between a multiprogramming OS and other systems.One way to display that you understand the benefits of multi-programming is to use a real-life example. By offering an instance when you used multi-programming to receive such benefits, you are displaying hands-on knowledge of a system that might be important to the interviewer."},
        {"ques":"What is virtual memory?", "ans":"Virtual memory is a memory management method that helps to execute the process using the primary and secondary memory. Though the program gets executed using the main memory, the resources and pages load from the secondary memory."},
        {"ques":"What is Thrashing?", "ans":"Thrashing is a situation when the performance of a computer degrades or collapses. Thrashing occurs when a system spends more time processing page faults than executing transactions. While processing page faults is necessary to in order to appreciate the benefits of virtual memory, thrashing has a negative affect on the system. As the page fault rate increases, more transactions need processing from the paging device. The queue at the paging device increases, resulting in increased service time for a page fault."},
        {"ques":"What is the difference between micro kernel and macro kernel?", "ans":"Micro kernel: micro kernel is the kernel which runs minimal performance affecting services for operating system. In micro kernel operating system all other operations are performed by processor.Macro Kernel:Macro Kernel is a combination of micro and monolithic kernel."},
        {"ques":"How Are Server Systems Classified?", "ans":"Server systems can be classified as either computer-server systems or file server systems. In the first case, an interface is made available for clients to send requests to perform an action. In the second case, provisions are available for clients to create, access and update files."}
    ],
    "Data Structures and Algorithms" : [
        {"ques":"What are Data Structures?", "ans":"A data structure is a mechanical or logical way that data is organized within a program. The organization of data is what determines how a program performs."},
        {"ques":"Why Create Data Structures?", "ans":"Data structures serve a number of important functions in a program. They ensure that each line of code performs its function correctly and efficiently, they help the programmer identify and fix problems with his/her code, and they help to create a clear and organized code base."},
        {"ques":"What is a queue data structure?", "ans":"A queue is a linear data structure that allows users to store items in a list in a systematic manner. The items are added to the queue at the rear end until they are full, at which point they are removed from the queue from the front."},
        {"ques":"What is a stack data structure?", "ans":"A stack is a data structure that is used to represent the state of an application at a particular point in time. The stack consists of a series of items that are added to the top of the stack and then removed from the top."},
        {"ques":"What is array data structure?", "ans":"An array data structure is a data structure that is used to store data in a way that is efficient and easy to access. It is similar to a list in that it stores data in a sequence."},
        {"ques":"What is a linked list data structure?", "ans":"A linked list can be thought of as a series of linked nodes (or items) that are connected by links (or paths). Each link represents an entry into the linked list, and each entry points to the next node in the sequence."}, 
        {"ques":"What is an asymptotic analysis of an algorithm?", "ans":"Asymptotic analysis of an algorithm defines the run-time performance as per its mathematical boundations. Asymptotic analysis helps us articulate the best case(Omega Notation, Ω), average case(Theta Notation, θ), and worst case(Big Oh Notation, Ο) performance of an algorithm."},
        {"ques":"What is hashmap in data structure?", "ans":"Hashmap is a data structure that uses an implementation of a hash table data structure which allows access to data in constant time (O(1)) complexity if you have the key."},
        {"ques":"What is binary tree data structure?", "ans":"A binary tree is a data structure that is used to organize data in a way that allows for efficient retrieval and manipulation. It is a data structure that uses two nodes, called leaves and nodes, to represent the data."},
        {"ques":"What is binary search tree data structure?", "ans":"A binary search tree is a data structure that stores items in sorted order. In a binary search tree, each node stores a key and a value. The key is used to access the item and the value is used to determine whether the item is present or not."},
        {"ques":"What is graph data structure?", "ans":"A graph is a type of non-linear data structure made up of nodes and edges. The nodes are also known as vertices, and edges are lines or arcs that connect any two nodes in the graph."},
        {"ques":"What is AVL tree data structure?", "ans":"AVL trees are height balancing binary search trees named after their inventors Adelson, Velski, and Landis. The AVL tree compares the heights of the left and right subtrees and ensures that the difference is less than one. This distinction is known as the Balance Factor."}
    ],
    "Object Oriented Programming":[
        {"ques":"What is meant by the term OOPs?", "ans":"OOPs refers to Object-Oriented Programming. It is the programming paradigm that is defined using objects. Objects can be considered as real-world instances of entities like class, that have some characteristics and behaviors."},
        {"ques":"What are some major Object Oriented Programming languages?", "ans":"Java, Pyhton,C++,Javascript"},
        {"ques":"What is meant by Structured Programming?", "ans":"Structured Programming refers to the method of programming which consists of a completely structured control flow. Here structure refers to a block, which contains a set of rules, and has a definitive control flow, such as (if/then/else), (while and for), block structures, and subroutines.Nearly all programming paradigms include Structured programming, including the OOPs model."},
        {"ques":"What are the main features of OOPs?", "ans":"Inheritance,Encapsulation,Polymorphism,Data Abstraction"},
        {"ques":"What are some advantages of using OOPs?", "ans":"OOPs is very helpful in solving very complex level of problems.Highly complex programs can be created, handled, and maintained easily using object-oriented programming.OOPs, promote code reuse, thereby reducing redundancy."},
        {"ques":"What is a class?", "ans":"A class can be understood as a template or a blueprint, which contains some values, known as member data or member, and some set of rules, known as behaviors or functions. So when an object is created, it automatically takes the data and functions that are defined in the class.Therefore the class is basically a template or blueprint for objects. Also one can create as many objects as they want based on a class."}, 
        {"ques":"What is an object?", "ans":"An object refers to the instance of the class, which contains the instance of the members and behaviors defined in the class template."},
        {"ques":"What is encapsulation?", "ans":"One can visualize Encapsulation as the method of putting everything that is required to do the job, inside a capsule and presenting that capsule to the user. What it means is that by Encapsulation, all the necessary data and methods are bind together and all the unnecessary details are hidden to the normal user. So Encapsulation is the process of binding data members and methods of a program together to do a specific job, without revealing unnecessary details."},
        {"ques":"What is Polymorphism?", "ans":"In OOPs, Polymorphism refers to the process by which some code, data, method, or object behaves differently under different circumstances or contexts. Compile-time polymorphism and Run time polymorphism are the two types of polymorphisms in OOPs languages."},
        {"ques":"What is a constructor?", "ans":"Constructors are special methods whose name is the same as the class name. The constructors serve the special purpose of initializing the objects."},
        {"ques":"What is meant by Inheritance?", "ans":"The term “inheritance” means “receiving some quality or behavior from a parent to an offspring.” In object-oriented programming, inheritance is the mechanism by which an object or class (referred to as a child) is created using the definition of another object or class (referred to as a parent). Inheritance not only helps to keep the implementation simpler but also helps to facilitate code reuse."},
        {"ques":"What is Abstraction?", "ans":"Abstraction is the method of hiding unnecessary details from the necessary ones. It is one of the main features of OOPs."}
    ],
    "Database Management System":[
        {"ques":"What is DBMS?", "ans":"DBMS stands for Database Management System, is a set of applications or programs that enable users to create and maintain a database. DBMS provides a tool or an interface for performing various operations such as inserting, deleting, updating, etc. into a database."},
        {"ques":"What is a Database?", "ans":"A Database is an organized, consistent, and logical collection of data that can easily be updated, accessed, and managed. Database mostly contains sets of tables or objects (anything created using create command is a database object) which consist of records and fields."},
        {"ques":"Mention the issues with traditional file-based systems that make DBMS a better choice?", "ans":"The absence of indexing in a traditional file-based system leaves us with the only option of scanning the full page and hence making the access of content tedious and super slow.Another issue is the lack of concurrency control."},
        {"ques":"What is meant by ACID properties in DBMS?", "ans":"ACID stands for Atomicity, Consistency, Isolation, and Durability in a DBMS these are those properties that ensure a safe and secure way of sharing data among multiple users."},
        {"ques":"Are NULL values in a database the same as that of blank space or zero?", "ans":"No, a NULL value is very different from that of zero and blank space as it represents a value that is assigned, unknown, unavailable, or not applicable as compared to blank space which represents a character and zero represents a number."},
        {"ques":"What is Data Warehousing?", "ans":"The process of collecting, extracting, transforming, and loading data from multiple sources and storing them in one database is known as data warehousing."}, 
        {"ques":"What is meant by an entity-relationship (E-R) model?", "ans":"An entity-relationship model is a diagrammatic approach to a database design where real-world objects are represented as entities and relationships between them are mentioned."},
        {"ques":"What is a lock?", "ans":"A database lock is a mechanism to protect a shared piece of data from getting updated by two or more database users at the same time."},
        {"ques":"What is meant by normalization?", "ans":"Normalization is a process of reducing redundancy by organizing the data into multiple tables. Normalization leads to better usage of disk spaces and makes it easier to maintain the integrity of the database."},
        {"ques":"What is Primary Key?", "ans":"The primary key defines a set of attributes that are used to uniquely identify every tuple."},
        {"ques":"What is Candidate Key?", "ans":"The candidate key represents a set of properties that can uniquely identify a table. Each table may have multiple candidate keys. One key amongst all candidate keys can be chosen as a primary key."},
        {"ques":"What is Entity?", "ans":"An entity is defined as a real-world object having attributes that represent characteristics of that particular object. For example, a student, an employee, or a teacher represents an entity."}
    ]
}